workspace/Catalogs/АукВидыАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукВидыАукционов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыОперацийАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукПродуктыАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СРаспределениемСуммы</Name>
					<Comment>Признак того, что при подведении итогов по аукциону данного вида будет использоваться распределение суммы аукциона</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоЗначенийСтруктурыСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоЗначенийСтруктурыВводныхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточныйИтогВариантВыбора</Name>
					<Comment>0 - Минимум, 1 - Максимум</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточныйИтогФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточныйИтогШаблонРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательныйИтогФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательныйИтогРаспределяемаяСуммаОсновная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательныйИтогРаспределяемаяСуммаДополнительная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаРасчетаПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукНастройкиРасчетовИтогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаРасчетаОкончательныхИтогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукНастройкиРасчетовИтогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураСтавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементСтавки</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОбязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураНачальныхДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПоУмолчанию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЧасы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/Catalogs/АукАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукАукционы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАукциона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийАукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийСтарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНачальныхДанных</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементНачальныхДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНачальныхДанных</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЧасы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/Catalogs/АукВидыАукционов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.Справочник_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Отказ Тогда
		Возврат; 
	КонецЕсли;
	
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.Справочник_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.Справочник_ПриОткрытии(ЭтотОбъект, Отказ);
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	НастроитьИнтерфейсПоУсловиям();
	
	ПодпискиНаСобытияФормКлиент.Справочник_ПослеОткрытия(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЭтотОбъект.ЭтоНовыйВидАукциона И ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		АукОбщийКлиент.ЗапускМастераПоРаспределениюУчастниковПоВидам(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.Свойство("ЭтоПромежуточнаяЗапись") Тогда
		Возврат;	
	КонецЕсли;
	
	ПроверитьЗаполнениеНастроекРасчетаИтогов(Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПромежуточныйИтогФормулаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Операнды",			АукОбщийКлиент.СписокПредставленийПоЭлементамТабличнойЧасти(Объект, "СтруктураСтавки", "ЭлементСтавки", Тип("Число")));
	ПараметрыФормы.Вставить("ИсходнаяФормула",	Объект.ПромежуточныйИтогФормула);
	
	Оповещение = Новый ОписаниеОповещения("ВводФормулыПромежуточногоИтога_Продолжить", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.АукВидыАукционов.Форма.КонструкторФормулы", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводФормулыПромежуточногоИтога_Продолжить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.ПромежуточныйИтогФормула = Результат;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончательныйИтогФормулаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ОкончательныйИтогРаспределяемаяСуммаОсновная)
		 Или ЗначениеЗаполнено(Объект.ОкончательныйИтогРаспределяемаяСуммаДополнительная)
	Тогда	 
	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Операнды",								ОперандыДляРасчетаОкончательногоИтога());																			
		ПараметрыФормы.Вставить("ИсходнаяФормула",						Объект.ОкончательныйИтогФормула);
		ПараметрыФормы.Вставить("ЭтоФормулаРасчетаОкончательныхИтогов",	Истина);
		
		Оповещение = Новый ОписаниеОповещения("ВводФормулыОкончательногоИтога_Продолжить", ЭтотОбъект);
		
		ОткрытьФорму("Справочник.АукВидыАукционов.Форма.КонструкторФормулы", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Формулу мржно задать только если укзаны основное или дополнительное поля'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводФормулыОкончательногоИтога_Продолжить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.ОкончательныйИтогФормула = Результат;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаРасчетИтогов Тогда
		
		ОбновитьСписокВыбораРаспределяемойСуммыОсновной();
		
		ОбновитьСписокВыбораРаспределяемойСуммыДополнительной();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончательныйИтогРаспределяемаяСуммаОсновнаяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.ОкончательныйИтогРаспределяемаяСуммаОсновная = "[" + ВыбранноеЗначение + "]";
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончательныйИтогРаспределяемаяСуммаДополнительнаяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.ОкончательныйИтогРаспределяемаяСуммаДополнительная = "[" + ВыбранноеЗначение + "]";
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРасчетаПромежуточныхИтоговОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	
	ОткрытьФормуНастройкиРасчетовИтогов(Объект.НастройкаРасчетаПромежуточныхИтогов, Истина);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРасчетаОкончательныхИтоговОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуНастройкиРасчетовИтогов(Объект.НастройкаРасчетаОкончательныхИтогов);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРасчетаПромежуточныхИтоговНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НастройкаРасчетаИтогов_ОбработатьНачалоВыбора(Элемент, СтандартнаяОбработка, "НастройкаРасчетаПромежуточныхИтогов", Истина);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРасчетаОкончательныхИтоговНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НастройкаРасчетаИтогов_ОбработатьНачалоВыбора(Элемент, СтандартнаяОбработка, "НастройкаРасчетаОкончательныхИтогов", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРасчетаПромежуточныхИтоговСоздание(Элемент, СтандартнаяОбработка)
	НастройкаРасчетаИтогов_ОбработатьСоздание(Элемент, СтандартнаяОбработка, "НастройкаРасчетаПромежуточныхИтогов", Истина);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРасчетаОкончательныхИтоговСоздание(Элемент, СтандартнаяОбработка)
	НастройкаРасчетаИтогов_ОбработатьСоздание(Элемент, СтандартнаяОбработка, "НастройкаРасчетаОкончательныхИтогов", Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗаполнитьСписокЭтаповПоУмолчанию(Команда)
	
	Объект.ЭтапыПоУмолчанию.Очистить();	
	
	масЭтапы = АукОбщийКлиентСервер.СписокЭтаповПоУмолчанию();
	
	Для Каждого ЭлЭтап Из масЭтапы Цикл
		ЗаполнитьЗначенияСвойств(Объект.ЭтапыПоУмолчанию.Добавить(), ЭлЭтап);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьКастомная(Команда)
	ПроверитьДанныеПередЗаписью(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКастомная(Команда)
	ПроверитьДанныеПередЗаписью(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПараметровПоУмолчанию(Команда)
	масПараметры = АукОбщийКлиентСервер.СписокПараметровПоУмолчанию();
	
	Объект.СтруктураПараметров.Очистить();
	
	Для Каждого ЭлПараметр Из масПараметры Цикл
		НовСтрока = Объект.СтруктураПараметров.Добавить();
		
		НовСтрока.Параметр = ЭлПараметр;
	КонецЦикла;
	
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеНастроекРасчетаИтогов(пОтказ)
	Если Не ЗначениеЗаполнено(Объект.НастройкаРасчетаПромежуточныхИтогов) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена настройка расчета промежуточных итогов'"),,, "Объект.НастройкаРасчетаПромежуточныхИтогов", пОтказ);	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.НастройкаРасчетаОкончательныхИтогов) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена настройка расчета окончательных итогов'"),,, "Объект.НастройкаРасчетаОкончательныхИтогов", пОтказ);	
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Функция НастройкиРасчетаИтоговПараметрыФормыВыбора(пБулЭтоНастройкаРасчетовПромежуточногоИтога)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭтоНастройкаРасчетовПромежуточногоИтога", пБулЭтоНастройкаРасчетовПромежуточногоИтога);
	ДополнительныеПараметры.Вставить("ОткрытиеИзФормыВладельца");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДополнительныеПараметры", ДополнительныеПараметры); 
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Объект.Ссылка));
	ПараметрыФормы.Вставить("ПараметрыВыбора", Новый Структура("Владелец", Объект.Ссылка));
	
	Возврат ПараметрыФормы;
КонецФункции

&НаКлиенте
Функция НастройкиРасчетаИтоговПараметрыФормыОбъекта(пБулЭтоНастройкаРасчетовПромежуточногоИтога)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭтоНастройкаРасчетовПромежуточногоИтога", пБулЭтоНастройкаРасчетовПромежуточногоИтога);
	ДополнительныеПараметры.Вставить("ОткрытиеИзФормыВладельца");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДополнительныеПараметры", ДополнительныеПараметры); 
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Владелец", Объект.Ссылка));
	ПараметрыФормы.Вставить("ПараметрыВыбора", Новый Структура("Владелец", Объект.Ссылка));
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Возврат ПараметрыФормы;
КонецФункции

&НаКлиенте
Процедура НастройкаРасчетаИтоговНачалоВыбора_Продолжить(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда		
		Если ПроверитьЗаполнение() Тогда
			Записать(Новый Структура("ЭтоПромежуточнаяЗапись"));
			
			ОткрытьФормуВыбораНастроекРасчета(ДополнительныеПараметры); 	
		КонецЕсли;	
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораНастроекРасчета(пСткПараметры)	
	ОткрытьФорму("Справочник.АукНастройкиРасчетовИтогов.ФормаВыбора", НастройкиРасчетаИтоговПараметрыФормыВыбора(пСткПараметры.ЭтоНастройкаРасчетаПромежуточногоИтога), пСткПараметры.Элемент); 			
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРасчетаИтоговСоздание_Продолжить(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда		
		Если ПроверитьЗаполнение() Тогда
			Записать(Новый Структура("ЭтоПромежуточнаяЗапись"));
			
			ОткрытьФормуСозданияНастроекРасчета(ДополнительныеПараметры); 	
		КонецЕсли;	
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСозданияНастроекРасчета(пСткПараметры)	
	ОткрытьФорму("Справочник.АукНастройкиРасчетовИтогов.ФормаОбъекта", НастройкиРасчетаИтоговПараметрыФормыОбъекта(пСткПараметры.ЭтоНастройкаРасчетаПромежуточногоИтога), пСткПараметры.Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРасчетаИтогов_ОбработатьСоздание(пЭлемент, пСтандартнаяОбработка, пИмяРеквизита, пБулЭтоНастройкаРасчетаПромежуточногоИтога)
	пСтандартнаяОбработка = Ложь;
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Элемент",			пЭлемент);
	сткПараметры.Вставить("ЭтоНастройкаРасчетаПромежуточногоИтога",		пБулЭтоНастройкаРасчетаПромежуточногоИтога);
	
	Если ЭтотОбъект.ЭтоНовыйВидАукциона Или Модифицированность Тогда	
		Оповещение = Новый ОписаниеОповещения("НастройкаРасчетаИтоговСоздание_Продолжить", ЭтотОбъект, сткПараметры);
		
		ТекстВопроса = НСтр("ru = 'Для продолжения необходимо записать элемент. Продолжить?'");
	
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, НСтр("ru = 'Предупреждение'"));	
	Иначе
		ОткрытьФормуСозданияНастроекРасчета(сткПараметры);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРасчетаИтогов_ОбработатьНачалоВыбора(пЭлемент, пСтандартнаяОбработка, пИмяРеквизита, пБулЭтоНастройкаРасчетаПромежуточногоИтога)
	пСтандартнаяОбработка = Ложь;
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Элемент",			пЭлемент);
	сткПараметры.Вставить("ЭтоНастройкаРасчетаПромежуточногоИтога",		пБулЭтоНастройкаРасчетаПромежуточногоИтога);
	
	Если Модифицированность Тогда	
		Оповещение = Новый ОписаниеОповещения("НастройкаРасчетаИтоговНачалоВыбора_Продолжить", ЭтотОбъект, сткПараметры);
		
		ТекстВопроса = НСтр("ru = 'Для продолжения необходимо записать элемент. Продолжить?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, НСтр("ru = 'Предупреждение'"));	
	Иначе
		ОткрытьФормуВыбораНастроекРасчета(сткПараметры);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиРасчетовИтогов(пКлюч, пБулЭтоНастройкаРасчетовПромежуточногоИтога = Ложь)
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Ключ", пКлюч);
	//ПараметрыФормы.Вставить("ЭтоНастройкаРасчетовПромежуточногоИтога", пЭтоНастройкаРасчетовПромежуточногоИтога);
	//ДополнительныеПараметры.Вставить("ОткрытиеИзФормыВладельца");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭтоНастройкаРасчетовПромежуточногоИтога", пБулЭтоНастройкаРасчетовПромежуточногоИтога);
	ДополнительныеПараметры.Вставить("ОткрытиеИзФормыВладельца");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", пКлюч);
	ПараметрыФормы.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.АукНастройкиРасчетовИтогов.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьДанныеПередЗаписью(пБулЭтоЗакрытие)
	Объект.ПромежуточныйИтогФормула = СокрЛП(Объект.ПромежуточныйИтогФормула);
		
	Если ПроверитьДанныеФормыПередЗаписью(пБулЭтоЗакрытие) Тогда	
		ЗаписатьИЗакрытьНачать(пБулЭтоЗакрытие);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура НастроитьИнтерфейсПоУсловиям()	
	Если ЭтотОбъект.БлокироватьИзмененияДанных Тогда
		АукОбщийКлиент.УставновитьРежимТолькоПросмотрУВсехЭлементов(ЭтотОбъект,, "Наименование,Описание,СтраницаЭтапыПоУмолчанию");
		
		АукОбщийКлиент.УстановитьВидимостьКоманд(ЭтотОбъект,, "ЗаписатьИЗакрытьКастомная,ЗаписатьКастомная,ЗаполнитьСписокЭтаповПоУмолчанию");
	Иначе
		Элементы.НадписьЗапретРедактирования.Видимость = Ложь;
	КонецЕсли;	
	
	Если АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		Элементы.СРаспределениемСуммы.Видимость = Ложь;
		
		Элементы.СтраницаРасчетИтогов.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ОперандыДляРасчетаОкончательногоИтога()

	масРезультат = АукОбщийКлиентСервер.ПредопределенныеОперандыДляРасчетаОкончательногоИтога();
	
	масОперандыСтавка = АукОбщийКлиент.СписокПредставленийПоЭлементамТабличнойЧасти(Объект, "СтруктураСтавки", "ЭлементСтавки", Тип("Число"));	
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масРезультат, масОперандыСтавка);
	
	//масНачДанные = АукОбщийКлиент.СписокПредставленийПоЭлементамТабличнойЧасти(Объект, "СтруктураНачальныхДанных", "ЭлементДанных", Тип("Число"));
	//
	//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масРезультат, масНачДанные);
	
	Возврат масРезультат;
	
КонецФункции	

&НаКлиенте
Функция ПроверитьДанныеФормыПередЗаписью(пБулЭтоЗакрытие)
	Если Не АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		Если Объект.СРаспределениемСуммы Тогда
			
			Если Не ДанныеДляРасчетаОкончательногоИтогаЗаполнены() Тогда				
				стрОповещение = НСтр("ru = 'Заполните необходимые данные для расчета окончательного итога или снимите флаг ""С распределением суммы""'");
				
				ПоказатьПредупреждение(, стрОповещение,, НСтр("ru = 'Предупреждение'"));
				
				Возврат Ложь;
			КонецЕсли;
		Иначе	
			Если ДанныеДляРасчетаОкончательногоИтогаЗаполнены() Тогда				
				стрВопрос = НСтр("ru = 'Заполнены необходимые данные для расчета итогов. Может установим флаг ""С распределением суммы""?'");
				
				Оповещение = Новый ОписаниеОповещения("УстановкаФлагаВопрос_Продолжить", ЭтотОбъект, пБулЭтоЗакрытие);
				
				ПоказатьВопрос(Оповещение, стрВопрос, РежимДиалогаВопрос.ДаНет);
				
				Возврат Ложь;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;	
КонецФункции

&НаКлиенте
Процедура УстановкаФлагаВопрос_Продолжить(Результат, пБулЭтоЗакрытие) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.СРаспределениемСуммы = Истина;
	КонецЕсли;
	
	ЗаписатьИЗакрытьНачать(пБулЭтоЗакрытие);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьНачать(пБулЭтоЗакрытие)
	Записать();
	
	Если пБулЭтоЗакрытие И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Закрыть();
	Иначе
		Если ЭтотОбъект.ЭтоНовыйВидАукциона И ЗначениеЗаполнено(Объект.Ссылка) Тогда
			АукОбщийКлиент.ЗапускМастераПоРаспределениюУчастниковПоВидам(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Функция ДанныеДляРасчетаОкончательногоИтогаЗаполнены()

	Возврат ЗначениеЗаполнено(Объект.ОкончательныйИтогФормула)
			И (ЗначениеЗаполнено(Объект.ОкончательныйИтогРаспределяемаяСуммаОсновная)
				Или ЗначениеЗаполнено(Объект.ОкончательныйИтогРаспределяемаяСуммаДополнительная))
	
КонецФункции	

&НаКлиенте
Процедура ОбновитьСписокВыбораРаспределяемойСуммыДополнительной()
	
	масСписокЭлементовСтрокой = АукОбщийКлиент.СписокПредставленийПоЭлементамТабличнойЧасти(Объект, "СтруктураНачальныхДанных", "ЭлементДанных", Тип("Число"));
	
	Элементы.ОкончательныйИтогРаспределяемаяСуммаДополнительная.СписокВыбора.ЗагрузитьЗначения(масСписокЭлементовСтрокой);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокВыбораРаспределяемойСуммыОсновной()
	
	масСписокЭлементовСтрокой = АукОбщийКлиент.СписокПредставленийПоЭлементамТабличнойЧасти(Объект, "СтруктураСтавки", "ЭлементСтавки", Тип("Число"));
	
	Элементы.ОкончательныйИтогРаспределяемаяСуммаОсновная.СписокВыбора.ЗагрузитьЗначения(масСписокЭлементовСтрокой);
	
КонецПроцедуры	

&НаСервере
Процедура НачальнаяИнициализация()
	ЭтотОбъект.ЭтоНовыйВидАукциона = Параметры.Ключ.Пустая();
	
	// Заполнить список этапов по-умолчанию
	Если ЭтотОбъект.ЭтоНовыйВидАукциона Тогда
		Если Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Объект.ЭтапыПоУмолчанию.Очистить();
			
			масЭтапы = АукОбщийКлиентСервер.СписокЭтаповПоУмолчанию();
			
			Для Каждого ЭлЭтап Из масЭтапы Цикл
				ЗаполнитьЗначенияСвойств(Объект.ЭтапыПоУмолчанию.Добавить(), ЭлЭтап);	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Инициализировать флаг "БлокироватьИзмененияДанных"
	Если Не ЭтотОбъект.ЭтоНовыйВидАукциона Тогда
		ЭтотОбъект.БлокироватьИзмененияДанных = Справочники.АукАукционы.ЕстьАукционыСВидом(Объект.Ссылка);	
	КонецЕсли;		
КонецПроцедуры	

#КонецОбласти
